sterentev/atdf-device-asm-include/inc/ATtiny261.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	SREG		= 0x3F		; Status Register
.equ	SPL		= 0x3D		; Stack Pointer Low Byte
.equ	GIMSK		= 0x3B		; General Interrupt Mask Register
.equ	GIFR		= 0x3A		; General Interrupt Flag register
.equ	TIMSK		= 0x39		; Timer/Counter Interrupt Mask Register
.equ	TIFR		= 0x38		; Timer/Counter0 Interrupt Flag register
.equ	SPMCSR		= 0x37		; Store Program Memory Control Register
.equ	PRR		= 0x36		; Power Reduction Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status register
.equ	TCCR0B		= 0x33		; Timer/Counter Control Register B
.equ	TCNT0L		= 0x32		; Timer/Counter0 Low
.equ	OSCCAL		= 0x31		; Oscillator Calibration Register
.equ	TCCR1A		= 0x30		; Timer/Counter Control Register A
.equ	TCCR1B		= 0x2F		; Timer/Counter Control Register B
.equ	TCNT1		= 0x2E		; Timer/Counter Register
.equ	OCR1A		= 0x2D		; Output Compare Register
.equ	OCR1B		= 0x2C		; Output Compare Register
.equ	OCR1C		= 0x2B		; Output compare register
.equ	OCR1D		= 0x2A		; Output compare register
.equ	PLLCSR		= 0x29		; PLL Control and status register
.equ	CLKPR		= 0x28		; Clock Prescale Register
.equ	TCCR1C		= 0x27		; Timer/Counter Control Register C
.equ	TCCR1D		= 0x26		; Timer/Counter Control Register D
.equ	TC1H		= 0x25		; Timer/Counter 1 Register High
.equ	DT1		= 0x24		; Timer/Counter 1 Dead Time Value
.equ	PCMSK0		= 0x23		; Pin Change Enable Mask 0
.equ	PCMSK1		= 0x22		; Pin Change Enable Mask 1
.equ	WDTCR		= 0x21		; Watchdog Timer Control Register
.equ	DWDR		= 0x20		; debugWire data register
.equ	EEAR		= 0x1E		; EEPROM Address Register  Bytes
.equ	EEDR		= 0x1D		; EEPROM Data Register
.equ	EECR		= 0x1C		; EEPROM Control Register
.equ	PORTA		= 0x1B		; Port A Data Register
.equ	DDRA		= 0x1A		; Port A Data Direction Register
.equ	PINA		= 0x19		; Port A Input Pins
.equ	PORTB		= 0x18		; Port B Data Register
.equ	DDRB		= 0x17		; Port B Data Direction Register
.equ	PINB		= 0x16		; Port B Input Pins
.equ	TCCR0A		= 0x15		; Timer/Counter  Control Register A
.equ	TCNT0H		= 0x14		; Timer/Counter0 High
.equ	OCR0A		= 0x13		; Timer/Counter0 Output Compare Register
.equ	OCR0B		= 0x12		; Timer/Counter0 Output Compare Register
.equ	USIPP		= 0x11		; USI Pin Position
.equ	USIBR		= 0x10		; USI Buffer Register
.equ	USIDR		= 0x0F		; USI Data Register
.equ	USISR		= 0x0E		; USI Status Register
.equ	USICR		= 0x0D		; USI Control Register
.equ	GPIOR2		= 0x0C		; General Purpose IO register 2
.equ	GPIOR1		= 0x0B		; General Purpose register 1
.equ	GPIOR0		= 0x0A		; General purpose register 0
.equ	ACSRB		= 0x09		; Analog Comparator Control And Status Register B
.equ	ACSRA		= 0x08		; Analog Comparator Control And Status Register A
.equ	ADMUX		= 0x07		; The ADC multiplexer Selection Register
.equ	ADCSRA		= 0x06		; The ADC Control and Status register
.equ	ADC		= 0x04		; ADC Data Register  Bytes
.equ	ADCSRB		= 0x03		; ADC Control and Status Register B
.equ	DIDR1		= 0x02		; Digital Input Disable Register 1
.equ	DIDR0		= 0x01		; Digital Input Disable Register 0
.equ	TCCR1E		= 0x00		; Timer/Counter1 Control Register E


; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - Left Adjust Result
.equ	MUX_MASK	= 0x1F		;      - Analog Channel and Gain Selection Bits (5 bits)
.equ	MUX0		= 0		;          MUX BIT0 position

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position
; ::::  ADPS	:::: bitfield values
;			0x00		; 2
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128

; ----------	Register ADCSRB bits		------------------------
.equ	BIN		= 7		; 0x80 - Bipolar Input Mode
.equ	GSEL		= 6		; 0x40 - Gain Select
.equ	IPR		= 5		; 0x20 - Input Polarity Mode
.equ	REFS2		= 4		; 0x10 - 
.equ	MUX5		= 3		; 0x08 - 
.equ	ADTS_MASK	= 0x07		;      - ADC Auto Trigger Sources (3 bits)
.equ	ADTS0		= 0		;          ADTS BIT0 position
; ::::  ADTS	:::: bitfield values
;			0x00		; Free Running mode
;			0x01		; Analog Comparator
;			0x02		; External Interrupt Request 0
;			0x03		; Timer/Counter0 Compare Match A
;			0x04		; Timer/Counter0 Overflow
;			0x05		; Timer/Counter1 Compare Match B
;			0x06		; Timer/Counter1 Overflow
;			0x07		; Watchdog Interrupt Request

; ----------	Register DIDR1 bits		------------------------
.equ	ADC10D		= 7		; 0x80 - ADC10 Digital input Disable
.equ	ADC9D		= 6		; 0x40 - ADC9 Digital input Disable
.equ	ADC8D		= 5		; 0x20 - ADC8 Digital input Disable
.equ	ADC7D		= 4		; 0x10 - ADC7 Digital input Disable

; ----------	Register DIDR0 bits		------------------------
.equ	ADC6D		= 7		; 0x80 - ADC6 Digital input Disable
.equ	ADC5D		= 6		; 0x40 - ADC5 Digital input Disable
.equ	ADC4D		= 5		; 0x20 - ADC4 Digital input Disable
.equ	ADC3D		= 4		; 0x10 - ADC3 Digital input Disable
.equ	AREFD		= 3		; 0x08 - AREF Digital Input Disable
.equ	ADC2D		= 2		; 0x04 - ADC2 Digital input Disable
.equ	ADC1D		= 1		; 0x02 - ADC1 Digital input Disable
.equ	ADC0D		= 0		; 0x01 - ADC0 Digital input Disable



; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ACSRB bits		------------------------
.equ	HSEL		= 7		; 0x80 - Hysteresis Select
.equ	HLEV		= 6		; 0x40 - Hysteresis Level
.equ	ACM_MASK	= 0x07		;      - Analog Comparator Multiplexer (3 bits)
.equ	ACM0		= 0		;          ACM BIT0 position

